/**
 * @author lzy
 * @version 1.0
 * Date: 2023/7/14 8:47
 * Description: No Description
 */
package lyzzcw.stupid.spring.day3;

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day3.component.LZY_Component}
 *  @Component 注解属性说明
 */

//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day3.value.LZY_Value}
 *  @Value 注解属性说明
 */
//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day3.autowired.LZY_Autowired}
 *  @Autowired 注解属性说明
 */
//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day3.qualifier.LZY_Qualifier}
 *  @Qualifier 注解属性说明
 */
//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day3.resource.LZY_Resource}
 *  @Resource 注解属性说明
 */
//----------------------------------------------------------------