/**
 * @author lzy
 * @version 1.0
 * Date: 2023/7/5 14:55
 * Description: No Description
 */
package lyzzcw.stupid.spring.day2;


//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day2.Import.LZY_Import}
 *  @Import 注解属性说明
 */

//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day2.propertysource.LZY_PropertySource}
 *  @PropertySource 注解属性说明
 */

//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day2.dependson.LZY_DependsOn}
 *  @DependsOn 注解属性说明
 */

//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day2.conditional.LZY_Conditional}
 *  @Conditional 注解属性说明
 */

//----------------------------------------------------------------

//----------------------------------------------------------------
/**
 * {@link lyzzcw.stupid.spring.day2.lazy.LZY_Lazy}
 *  @Lazy 注解属性说明
 */

//----------------------------------------------------------------